tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf45k80_tdd.h
#define CCH01                         3881
#define CCH11                         3882
#define C1CH1                         3883
#define CM1CON_CCH1                   3884
#define CM1CON_CREF                   3885
#define CREF1                         3886
#define EVPOL01                       3887
#define CM1CON_EVPOL0                 3888
#define CM1CON_EVPOL                  3889
#define CM1CON_EVPOL1                 3890
#define EVPOL11                       3891
#define CM1CON_CPOL                   3892
#define CPOL1                         3893
#define CM1CON_COE                    3894
#define COE1                          3895
#define CM1CON_CON                    3896
#define CON1                          3897
#define RXB0CON                       3898
#define RXB0CON_FILHIT0               3899
#define RXB0FILHIT0                   3900
#define JTOFF_FILHIT1                 3901
#define RXB0CON_FILHIT1               3902
#define RXB0FILHIT1                   3903
#define JTOFF                         3904
#define RB0DBEN_FILHIT2               3905
#define RB0DBEN                       3906
#define RXB0FILHIT2                   3907
#define RXB0CON_FILHIT2               3908
#define RXB0CON_RXRTRRO               3909
#define RXB0FILHIT3                   3910
#define RXB0CON_RXRTRRO_FILHIT3       3911
#define RXB0CON_FILHIT3               3912
#define RXB0RTRR0                     3913
#define RXB0CON_FILHIT4               3914
#define RXB0FILHIT4                   3915
#define RXB0RTRRO                     3916
#define RXB0CON_RXM0_RTRRO            3917
#define RXB0M0                        3918
#define RXB0CON_RTRRO                 3919
#define RXB0CON_RXM0                  3920
#define RXB0M1                        3921
#define RXB0CON_RXM1                  3922
#define RXB0FUL                       3923
#define RXB0CON_RXFUL                 3924
#define RXB0SIDH                      3925
#define RXB0SIDH_SID                  3926
#define RXB0SIDH_SID3                 3927
#define RXB0SID3                      3928
#define RXB0SIDH_SID4                 3929
#define RXB0SID4                      3930
#define RXB0SIDH_SID5                 3931
#define RXB0SID5                      3932
#define RXB0SIDH_SID6                 3933
#define RXB0SID6                      3934
#define RXB0SIDH_SID7                 3935
#define RXB0SID7                      3936
#define RXB0SIDH_SID8                 3937
#define RXB0SID8                      3938
#define RXB0SIDH_SID9                 3939
#define RXB0SID9                      3940
#define RXB0SIDH_SID10                3941
#define RXB0SID10                     3942
#define RXB0SIDL                      3943
#define RXB0SIDL_EID                  3944
#define RXB0SIDL_EID16                3945
#define RXB0EID16                     3946
#define RXB0SIDL_EID17                3947
#define RXB0EID17                     3948
#define RXB0EXID                      3949
#define RXB0SIDL_EXID                 3950
#define RXB0SIDL_SRR                  3951
#define RXB0SRR                       3952
#define RXB0SID0                      3953
#define RXB0SIDL_SID0                 3954
#define RXB0SIDL_SID                  3955
#define RXB0SIDL_SID1                 3956
#define RXB0SID1                      3957
#define RXB0SIDL_SID2                 3958
#define RXB0SID2                      3959
#define RXB0EIDH                      3960
#define RXB0EID8                      3961
#define RXB0EIDH_EID                  3962
#define RXB0EIDH_EID8                 3963
#define RXB0EID9                      3964
#define RXB0EIDH_EID9                 3965
#define RXB0EID10                     3966
#define RXB0EIDH_EID10                3967
#define RXB0EID11                     3968
#define RXB0EIDH_EID11                3969
#define RXB0EID12                     3970
#define RXB0EIDH_EID12                3971
#define RXB0EID13                     3972
#define RXB0EIDH_EID13                3973
#define RXB0EID14                     3974
#define RXB0EIDH_EID14                3975
#define RXB0EID15                     3976
#define RXB0EIDH_EID15                3977
#define RXB0EIDL                      3978
#define RXB0EID0                      3979
#define RXB0EIDL_EID                  3980
#define RXB0EIDL_EID0                 3981
#define RXB0EID1                      3982
#define RXB0EIDL_EID1                 3983
#define RXB0EID2                      3984
#define RXB0EIDL_EID2                 3985
#define RXB0EID3                      3986
#define RXB0EIDL_EID3                 3987
#define RXB0EID4                      3988
#define RXB0EIDL_EID4                 3989
#define RXB0EID5                      3990
#define RXB0EIDL_EID5                 3991
#define RXB0EID6                      3992
#define RXB0EIDL_EID6                 3993
#define RXB0EID7                      3994
#define RXB0EIDL_EID7                 3995
#define RXB0DLC                       3996
#define RXB0DLC_DLC0                  3997
#define RXB0DLC_DLC                   3998
#define RXB0DLC0                      3999
#define RXB0DLC1                      4000
#define RXB0DLC_DLC1                  4001
#define RXB0DLC2                      4002
#define RXB0DLC_DLC2                  4003
#define RXB0DLC3                      4004
#define RXB0DLC_DLC3                  4005
#define RXB0DLC_RB                    4006
#define RXB0RB0                       4007
#define RXB0DLC_RB0                   4008
#define RXB0RB1                       4009
#define RXB0DLC_RB1                   4010
#define RXB0DLC_RXRTR                 4011
#define RXB0RTR                       4012
#define RXB0D0                        4013
#define RXB0D00                       4014
#define RXB0D01                       4015
#define RXB0D02                       4016
#define RXB0D03                       4017
#define RXB0D04                       4018
#define RXB0D05                       4019
#define RXB0D06                       4020
#define RXB0D07                       4021
#define RXB0D1                        4022
#define RXB0D10                       4023
#define RXB0D11                       4024
#define RXB0D12                       4025
#define RXB0D13                       4026
#define RXB0D14                       4027
#define RXB0D15                       4028
#define RXB0D16                       4029
#define RXB0D17                       4030
#define RXB0D2                        4031
#define RXB0D20                       4032
#define RXB0D21                       4033
#define RXB0D22                       4034
#define RXB0D23                       4035
#define RXB0D24                       4036
#define RXB0D25                       4037
#define RXB0D26                       4038
#define RXB0D27                       4039
#define RXB0D3                        4040
#define RXB0D30                       4041
#define RXB0D31                       4042
#define RXB0D32                       4043
#define RXB0D33                       4044
#define RXB0D34                       4045
#define RXB0D35                       4046
#define RXB0D36                       4047
#define RXB0D37                       4048
#define RXB0D4                        4049
#define RXB0D40                       4050
#define RXB0D41                       4051
#define RXB0D42                       4052
#define RXB0D43                       4053
#define RXB0D44                       4054
#define RXB0D45                       4055
#define RXB0D46                       4056
#define RXB0D47                       4057
#define RXB0D5                        4058
#define RXB0D50                       4059
#define RXB0D51                       4060
#define RXB0D52                       4061
#define RXB0D53                       4062
#define RXB0D54                       4063
#define RXB0D55                       4064
#define RXB0D56                       4065
#define RXB0D57                       4066
#define RXB0D6                        4067
#define RXB0D60                       4068
#define RXB0D61                       4069
#define RXB0D62                       4070
#define RXB0D63                       4071
#define RXB0D64                       4072
#define RXB0D65                       4073
#define RXB0D66                       4074
#define RXB0D67                       4075
#define RXB0D7                        4076
#define RXB0D70                       4077
#define RXB0D71                       4078
#define RXB0D72                       4079
#define RXB0D73                       4080
#define RXB0D74                       4081
#define RXB0D75                       4082
#define RXB0D76                       4083
#define RXB0D77                       4084
#define CANSTAT                       4085
#define CANSTAT_EICODE0               4086
#define CANSTAT_EICODE1               4087
#define CANSTAT_ICODE0                4088
#define CANSTAT_EICODE1_ICODE0        4089
#define CANSTAT_EICODE2               4090
#define CANSTAT_ICODE1                4091
#define CANSTAT_EICODE2_ICODE1        4092
#define CANSTAT_EICODE3               4093
#define CANSTAT_ICODE2                4094
#define CANSTAT_EICODE3_ICODE2        4095
#define CANSTAT_EICODE4               4096
#define CANSTAT_OPMODE0               4097
#define CANSTAT_OPMODE                4098
#define CANSTAT_OPMODE1               4099
#define CANSTAT_OPMODE2               4100
#define CANCON                        4101
#define CANCON_FP0                    4102
#define CANCON_FP1                    4103
#define CANCON_WIN0                   4104
#define CANCON_WIN0_FP1               4105
#define CANCON_FP2                    4106
#define CANCON_WIN1                   4107
#define CANCON_WIN1_FP2               4108
#define CANCON_FP3                    4109
#define CANCON_WIN2                   4110
#define CANCON_WIN2_FP3               4111
#define CANCON_ABAT                   4112
#define CANCON_REQOP                  4113
#define CIOCON                        4114
#define CLKSEL                        4115
#define CANCAP                        4116
#define ENDRHI                        4117
#define TX2EN                         4118
#define TX2SRC                        4119
#define COMSTAT                       4120
#define EWARN                         4121
#define RXWARN                        4122
#define TXWARN                        4123
#define RXBP                          4124
#define TXBP                          4125
#define TXBO                          4126
#define RXB1OVFL                      4127
#define RXBNOVFL                      4128
#define FIFOEMPTY                     4129
#define RXB0OVFL                      4130
#define NOT_FIFOEMPTY                 4131
#define nFIFOEMPTY                    4132
#define ECANCON                       4133
#define EWIN                          4134
#define EWIN0                         4135
#define EWIN1                         4136
#define EWIN2                         4137
#define EWIN3                         4138
#define EWIN4                         4139
#define FIFOWM                        4140
#define MDSEL0                        4141
#define MDSEL                         4142
#define MDSEL1                        4143
#define EEDATA                        4144
#define EEADR                         4145
#define EEADRH                        4146
#define PIE5                          4147
#define FIFOWMIE                      4148
#define PIE5_RXB0IE                   4149
#define RXBnIE                        4150
#define PIE5_RXB1IE                   4151
#define PIE5_TXB0IE                   4152
#define PIE5_TXB1IE                   4153
#define PIE5_TXB2IE                   4154
#define TXBnIE                        4155
#define ERRIE                         4156
#define WAKIE                         4157
#define IRXIE                         4158
#define PIR5                          4159
#define FIFOWMIF                      4160
#define RXB0IF                        4161
#define RXBnIF                        4162
#define RXB1IF                        4163
#define TXB0IF                        4164
#define TXB1IF                        4165
#define TXB2IF                        4166
#define TXBnIF                        4167
#define ERRIF                         4168
#define WAKIF                         4169
#define IRXIF                         4170
#define IPR5                          4171
#define RXB0IP                        4172
#define CCH05                         4173
#define FIFOWMIP                      4174
#define RXB1IP                        4175
#define CCH15                         4176
#define RXBnIP                        4177
#define TXB0IP                        4178
#define EVPOL05                       4179
#define TXB1IP                        4180
#define EVPOL15                       4181
#define TXBnIP                        4182
#define TXB2IP                        4183
#define ERRIP                         4184
#define WAKIP                         4185
#define IRXIP                         4186
#define TXREG2                        4187
#define RCREG2                        4188
#define SPBRG2                        4189
#define SPBRGH2                       4190
#define SPBRGH1                       4191
#define EECON2                        4192
#define EECON1                        4193
#define RD                            4194
#define WR                            4195
#define WREN                          4196
#define WRERR                         4197
#define FREE                          4198
#define CFGS                          4199
#define EEFS                          4200
#define EEPGD                         4201
#define PORTA                         4202
#define ULPWUIN                       4203
#define RA0                           4204
#define RA1                           4205
#define RA2                           4206
#define RA3                           4207
#define LVDIN                         4208
#define RA5                           4209
#define RA6                           4210
#define RA7                           4211
#define RJPU                          4212
#define PORTB                         4213
#define PORTB_RB0                     4214
#define PORTB_RB1                     4215
#define RB2                           4216
#define CCP2_PA2                      4217
#define RB3                           4218
#define RB4                           4219
#define RB5                           4220
#define RB6                           4221
#define RB7                           4222
#define PORTC                         4223
#define RC0                           4224
#define PA2                           4225
#define RC1                           4226
#define CCP2                          4227
#define PA1                           4228
#define RC2                           4229
#define RC3                           4230
#define RC4                           4231
#define RC5                           4232
#define RC6                           4233
#define RC7                           4234
#define PORTD                         4235
#define RD0                           4236
#define RD1                           4237
#define RD2                           4238
#define RD3                           4239
#define RD4                           4240
#define RD5                           4241
#define RD6                           4242
#define RD7                           4243
#define SS2                           4244
#define PORTE                         4245
#define RE0                           4246
#define PD2                           4247
#define RDE                           4248
#define WRE                           4249
#define RE1                           4250
#define PC2                           4251
#define CCP10                         4252
#define PB2                           4253
#define RE2                           4254
#define CS                            4255
#define RE3                           4256
#define CCP9E                         4257
#define PC3E                          4258
#define TMR4                          4259
#define T4CON                         4260
#define T4CKPS0                       4261
#define T4CKPS                        4262
#define T4CKPS1                       4263
#define TMR4ON                        4264
#define T4OUTPS                       4265
#define T4OUTPS0                      4266
#define T4OUTPS1                      4267
#define T4OUTPS2                      4268
#define T4OUTPS3                      4269
#define LATA                          4270
#define LATA0                         4271
#define LA0                           4272
#define LATA1                         4273
#define LA1                           4274
#define LATA2                         4275
#define LA2                           4276
#define LATA3                         4277
#define LA3                           4278
#define LATA5                         4279
#define LA5                           4280
#define LATA6                         4281
#define LA6                           4282
#define LATA7                         4283
#define LA7                           4284
#define LATB                          4285
#define LB0                           4286
#define LATB0                         4287
#define LB1                           4288
#define LATB1                         4289
#define LB2                           4290
#define LATB2                         4291
#define LB3                           4292
#define LATB3                         4293
#define LB4                           4294
#define LATB4                         4295
#define LB5                           4296
#define LATB5                         4297
#define LB6                           4298
#define LATB6                         4299
#define LB7                           4300
#define LATB7                         4301
#define LATC                          4302
#define LATC0                         4303
#define LC0                           4304
#define LATC1                         4305
#define LC1                           4306
#define LATC2                         4307
#define LC2                           4308
#define LATC3                         4309
#define LC3                           4310
#define LATC4                         4311
#define LC4                           4312
#define LATC5                         4313
#define LC5                           4314
#define LATC6                         4315
#define LC6                           4316
#define LATC7                         4317
#define LC7                           4318
#define LATD                          4319
#define LATD0                         4320
#define LD0                           4321
#define LATD1                         4322
#define LD1                           4323
#define LATD2                         4324
#define LD2                           4325
#define LATD3                         4326
#define LD3                           4327
#define LATD4                         4328
#define LD4                           4329
#define LATD5                         4330
#define LD5                           4331
#define LATD6                         4332
#define LD6                           4333
#define LATD7                         4334
#define LD7                           4335
#define LATE                          4336
#define LATE0                         4337
#define LE0                           4338
#define LATE1                         4339
#define LE1                           4340
#define LATE2                         4341
#define LE2                           4342
#define SLRCON                        4343
#define SLRA                          4344
#define SLRB                          4345
#define SLRC                          4346
#define SLRD                          4347
#define SLRE                          4348
#define ODCON                         4349
#define U1OD                          4350
#define U2OD                          4351
#define CCP1OD                        4352
#define CCP2OD                        4353
#define CCP3OD                        4354
#define CCP4OD                        4355
#define CCP5OD                        4356
#define SSPOD                         4357
#define TRISA                         4358
#define TRISA0                        4359
#define TRISA1                        4360
#define TRISA2                        4361
#define TRISA3                        4362
#define TRISA5                        4363
#define TRISA6                        4364
#define TRISA7                        4365
#define TRISB                         4366
#define TRISB0                        4367
#define TRISB1                        4368
#define TRISB2                        4369
#define TRISB3                        4370
#define TRISB4                        4371
#define TRISB5                        4372
#define TRISB6                        4373
#define TRISB7                        4374
#define TRISC                         4375
#define TRISC0                        4376
#define TRISC1                        4377
#define TRISC2                        4378
#define TRISC3                        4379
#define TRISC4                        4380
#define TRISC5                        4381
#define TRISC6                        4382
#define TRISC7                        4383
#define TRISD                         4384
#define TRISD0                        4385
#define TRISD1                        4386
#define TRISD2                        4387
#define TRISD3                        4388
#define TRISD4                        4389
#define TRISD5                        4390
#define TRISD6                        4391
#define TRISD7                        4392
#define TRISE                         4393
#define TRISE0                        4394
#define TRISE1                        4395
#define TRISE2                        4396
#define CCPTMRS                       4397
#define C1TSEL                        4398
#define C2TSEL                        4399
#define C3TSEL                        4400
#define C4TSEL                        4401
#define C5TSEL                        4402
#define REFOCON                       4403
#define RODIV0                        4404
#define RODIV                         4405
#define RODIV1                        4406
#define RODIV2                        4407
#define RODIV3                        4408
#define ROSEL                         4409
#define ROSSLP                        4410
#define ROON                          4411
#define OSCTUNE                       4412
#define TUN0                          4413
#define TUN                           4414
#define TUN1                          4415
#define TUN2                          4416
#define TUN3                          4417
#define TUN4                          4418
#define TUN5                          4419
#define PLLEN                         4420
#define INTSRC                        4421
#define PSTR1CON                      4422
#define STRA                          4423
#define STRB                          4424
#define STRC                          4425
#define STRD                          4426
#define STRSYNC                       4427
#define CMPL                          4428
#define CMPL0                         4429
#define CMPL1                         4430
#define PIE1                          4431
#define TMR1IE                        4432
#define TMR2IE                        4433
#define TMR1GIE                       4434
#define SSPIE                         4435
#define PIE1_TX1IE                    4436
#define TXIE                          4437
#define RCIE                          4438
